Catalogs/СообщенияРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СообщенияРЭМД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнейОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрируемыеЭлектронныеМедДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРЭМД</Name>
					<Comment>emdrId</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторШаблонаЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереотправок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВПроцессеРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеПодписиЭМД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуПодписиЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРЭМД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПодписьМО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД_ЭЦП</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециальностьМинздрава</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Версии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлуЭМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИнтеграцияЕГИСЗСообщенияРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИнтеграцияЕГИСЗСообщенияРЭМД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторРЭМД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипВызоваРЭМД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭлектронныеПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеПодписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия набора ключевых реквизитов для подписания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомуВыданСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиПодписи</Name>
					<Comment>Заполнено только в том случае, если подпись неверна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиСертификата</Name>
					<Comment>Заполнено только в том случае, если сертификат недействителен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанФайлЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Подписанный объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодписанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTMLШаблон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличныйДокумент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РежимыОтправкиСообщенийРЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимыОтправкиСообщенийРЭМД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриПодписанииДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнымЗаданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалидацияИРучнаяОтправкаОтветственным</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СообщенияРЭМД/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура СформироватьНовоеСообщениеПоЭЦПФайла(Документ, ДанныеФайла, ДанныеЭЦПФайла, СпециальностиПоЭМД) Экспорт
	
	Если ДанныеФайла = Неопределено Тогда
		Сообщить("Не заполнены ДанныеФайла - формирование сообщения РЭМД невозможно!");
		Возврат;
	КонецЕсли;
	
	// Получим все подписи документа
	ПодписиВыборка = доп_СертификатыЭЦП.ПолучитьЭлектронныеПодписи(Документ.Ссылка);
	ИдентификаторДокумента = Строка(Новый УникальныйИдентификатор);
	
	Подписи = Новый Массив();
	инд = 1;
	Пока ПодписиВыборка.Следующий() Цикл
		
		СтруктураПодписи = ПолучитьДанныеЭлектронныхПодписейИзРезультатаПодписания(Документ, ПодписиВыборка);
		// Будем использовать только данные тех подписей, которые есть во входящем массиве ДанныеЭЦПФайла.
		Для Каждого ПодписьФайла Из ДанныеЭЦПФайла Цикл
			Если ПодписьФайла.УИД_ЭЦП = ПодписиВыборка.УникальныйИдентификатор Тогда
				
				ДвоичныеДанныеПодписи = ПодписиВыборка.Подпись.Получить();
				
				ИмяФайлаПодписи = ИдентификаторДокумента + "_sign" + инд;
				ПутиДляПодписи = ПолучитьНовыйПутьКФайлуВХранилище(ИмяФайлаПодписи, Документ.Филиал);
				ДвоичныеДанныеПодписи.Записать(ПутиДляПодписи.ПолныйПуть);
				
				ДанныеПодписи = Новый Структура;
				ДанныеПодписи.Вставить("ОтносительныйПутьКФайлуПодписиЭМД",	ПутиДляПодписи.ОтносительныйПуть);
				ДанныеПодписи.Вставить("РольРЭМД",							ПодписьФайла.РольСотрудника);
				ДанныеПодписи.Вставить("Сотрудник",							СтруктураПодписи.Сотрудник);
				ДанныеПодписи.Вставить("ЭтоПодписьМО",						СтруктураПодписи.ЭтоПодписьМО);
				ДанныеПодписи.Вставить("УИД_ЭЦП",							ПодписьФайла.УИД_ЭЦП);
				ДанныеПодписи.Вставить("ДолжностьМинздрава",				ПодписьФайла.ДолжностьМинздрава);
				ДанныеПодписи.Вставить("СпециальностьМинздрава",			СпециальностиПоЭМД.Получить(ПодписьФайла.УИД_ЭЦП));
				
				Подписи.Добавить(ДанныеПодписи);
				
				инд = инд + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Документ",				Документ);
	ДанныеСообщения.Вставить("ПутьКФайлуЭМД",			ДанныеФайла.ИмяФайла);
	ДанныеСообщения.Вставить("Клиент",					Документ.Клиент);
	ДанныеСообщения.Вставить("ИдентификаторДокумента",	ИдентификаторДокумента);
	ДанныеСообщения.Вставить("НомерДокумента",			Строка(Документ.УникальныйИдентификатор()));
	ДанныеСообщения.Вставить("ВидДокумента",			ДанныеФайла.ВидДокументаШаблона);
	ДанныеСообщения.Вставить("НомерВерсии",				Документ);
	
	// Когда требуется перезаписать существующее сообщение, то ссылка на него приходит в структуре ДанныеФайла
	Если ДанныеФайла.Свойство("СообщениеРЭМД") Тогда
		ДанныеСообщения.Вставить("СообщениеРЭМД", ДанныеФайла.СообщениеРЭМД);
	КонецЕсли;
	Если ДанныеФайла.Свойство("УИД_Шаблона") Тогда
		ДанныеСообщения.Вставить("УИД_Шаблона", ДанныеФайла.УИД_Шаблона);
	КонецЕсли;
	
	Если Документ.Тестовый Тогда
		СообщениеРЭМДСсылка = Справочники.СообщенияРЭМД.ПустаяСсылка();
	Иначе
		СообщениеРЭМДСсылка = ДобавитьСообщениеВСправочник(ДанныеСообщения, Подписи);
	КонецЕсли;
	
	ДанныеФайла.Вставить("СообщениеРЭМД", СообщениеРЭМДСсылка);
	
КонецПроцедуры

Процедура СформироватьНовоеСообщениеПоМедицинскомуДокументу(Документ) Экспорт
	
	ИдентификаторДокумента = Строка(Новый УникальныйИдентификатор);
	
	Подписи = Новый Массив;
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	
	Для Каждого СтрокаПодписи Из ДокументОбъект.РолиИПодписиЭМД Цикл
		СтруктураПодписи = СтрокаПодписи.ФайлПодписи.Получить();
		ДвоичныеДанныеПодписи = СтруктураПодписи.ДвоичныеДанные;
		
		ИмяФайлаПодписи = ИдентификаторДокумента + "_sign" + СтрокаПодписи.НомерСтроки;
		ПутиДляПодписи = ПолучитьНовыйПутьКФайлуВХранилище(ИмяФайлаПодписи, Документ.Филиал);
		ДвоичныеДанныеПодписи.Записать(ПутиДляПодписи.ПолныйПуть);
		
		ДанныеПодписи = Новый Структура;
		ДанныеПодписи.Вставить("ОтносительныйПутьКФайлуПодписиЭМД",	ПутиДляПодписи.ОтносительныйПуть);
		ДанныеПодписи.Вставить("РольРЭМД",							СтрокаПодписи.РольСотрудника);
		ДанныеПодписи.Вставить("Сотрудник",							СтрокаПодписи.Сотрудник);
		ДанныеПодписи.Вставить("ЭтоПодписьМО",						СтрокаПодписи.ПодписьМО);
		ДанныеПодписи.Вставить("УИД_ЭЦП",							СтрокаПодписи.УИД_ЭЦП);
		ДанныеПодписи.Вставить("ДолжностьМинздрава",				СтрокаПодписи.ДолжностьМинздрава);
		ДанныеПодписи.Вставить("СпециальностьМинздрава",			СтрокаПодписи.СпециальностьМинздрава);
		
		Подписи.Добавить(ДанныеПодписи);
		
		// Перемещаем файл подписи из базы в каталог
		СтрокаПодписи.ФайлПодписи = Неопределено;
		СтрокаПодписи.ПутьКФайлуВАрхиве = ПутиДляПодписи.ОтносительныйПуть;
	КонецЦикла;
	
	СтрокаЭМД = ДокументОбъект.ЭМД[0];
	СтруктураЭМД = СтрокаЭМД.ФайлЭМД.Получить();
	ДвоичныеДанныеЭМД = СтруктураЭМД.ДвоичныеДанные;
	
	ПутьКАрхивуРЭМД = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПутьКАрхивуРЭМД(Документ.Филиал);
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКАрхивуРЭМД) + Строка(Новый УникальныйИдентификатор);
	
	МассивСтрок = СтрокаЭМД.ВидДокументаЭМД.Атрибуты.НайтиСтроки(Новый Структура("Ключ", "FORMAT"));
	// Конечный формат файла либо *.xml, либо *.PDF/A - в зависимости от описания выбранного вида ЭМД.
	Если МассивСтрок.Количество() > 0 И МассивСтрок[0].Значение = "2" Тогда
		ИмяФайлаЭМД = ИмяФайлаБезРасширения + ".xml";
	Иначе
		ИмяФайлаЭМД = ИмяФайлаБезРасширения + ".pdf";
	КонецЕсли;
	
	ДвоичныеДанныеЭМД.Записать(ИмяФайлаЭМД);
	ОтносительныйПутьФайлаВАрхиве = ПолучитьОтносительныйПутьФайлаВАрхиве(ИмяФайлаЭМД);
	
	// Перемещаем файл ЭМД из базы в каталог
	СтрокаЭМД.ФайлЭМД = Неопределено;
	СтрокаЭМД.ПутьКФайлуВАрхиве = ОтносительныйПутьФайлаВАрхиве;
	
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("Документ",				Документ);
	ДанныеСообщения.Вставить("ПутьКФайлуЭМД",			ОтносительныйПутьФайлаВАрхиве);
	ДанныеСообщения.Вставить("Клиент",					Документ.Клиент);
	ДанныеСообщения.Вставить("ИдентификаторДокумента",	ИдентификаторДокумента);
	ДанныеСообщения.Вставить("НомерДокумента",			Строка(Документ.УникальныйИдентификатор()));
	ДанныеСообщения.Вставить("ВидДокумента",			СтрокаЭМД.ВидДокументаЭМД);
	ДанныеСообщения.Вставить("СообщениеРЭМД",			СтрокаЭМД.СообщениеРЭМД);
	ДанныеСообщения.Вставить("УИД_Шаблона",				СтрокаЭМД.УИД_Шаблона);
	
	СообщениеРЭМДСсылка = ДобавитьСообщениеВСправочник(ДанныеСообщения, Подписи);
	
	Если ЗначениеЗаполнено(СообщениеРЭМДСсылка) Тогда
		СтрокаЭМД.СообщениеРЭМД = СообщениеРЭМДСсылка;
		ДокументОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлыЭМДПоМД(Документ, СотрудникУстановившийПодпись, ДолжностиМЗ, ТекстыОшибок) Экспорт
	
	ФайлыЭМД = Новый Массив;
	
	ПутьКАрхивуРЭМД = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПутьКАрхивуРЭМД(Документ.Филиал);
	
	ДополнительныеПараметры = ИнтеграцияЕГИСЗВызовСервера.ДополнительныеПараметрыДляРаботыССЭМД();
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Документ);
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		Шаблоны = Документ.ШаблоныПриема.Выгрузить();
		
		ВерсииШаблонов = Новый ТаблицаЗначений;
		ВерсииШаблонов.Колонки.Добавить("ВерсияШаблона");
		ВерсииШаблонов.Колонки.Добавить("ШаблонПриема");
		ДокументыПриемаКлиентСервер.ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Документ);
		
		Для Каждого СтрокаШаблона Из Шаблоны Цикл
			
			СтрокаВерсии = ВерсииШаблонов.Найти(СтрокаШаблона.ШаблонПриема, "ШаблонПриема");
			Если СтрокаВерсии <> Неопределено Тогда
				ДополнительныеПараметры.ШаблонОсмотра = СтрокаВерсии.ВерсияШаблона;
			Иначе
				ДополнительныеПараметры.ШаблонОсмотра = СтрокаШаблона.ШаблонПриема;
			КонецЕсли;
			
			ДополнительныеПараметры.УИДШаблона		= СтрокаШаблона.УИД;
			ДополнительныеПараметры.ИндексШаблона	= Шаблоны.Индекс(СтрокаШаблона);
			ДополнительныеПараметры.СтрокаШаблона	= СтрокаШаблона;
			
			ДолжностьМЗ = ДолжностиМЗ.Получить(СтрокаШаблона.УИД);
			СформироватьФайлЭМД(Документ, ПутьКАрхивуРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстыОшибок, ФайлыЭМД, ДополнительныеПараметры);
		КонецЦикла;
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		Если ЗначениеЗаполнено(Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки) Тогда
			
			ДополнительныеПараметры.ШаблонОсмотра		 = Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки;
			ДополнительныеПараметры.ВредныйФакторСправки = Документ.Номенклатура.ВредныйФакторСправки;
			
			УИДПриказаВредногоФактора = ИнтеграцияЕГИСЗВызовСервера.ПолучитьУИДПоПриказуВредномуФактору(Документ, Документ.Номенклатура.ВредныйФакторСправки);
			ДолжностьМЗ = ДолжностиМЗ.Получить(УИДПриказаВредногоФактора);
			СформироватьФайлЭМД(Документ, ПутьКАрхивуРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстыОшибок, ФайлыЭМД, ДополнительныеПараметры);
		Иначе
			МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
			ПриказыВредныеФакторы = МодульМедосмотрыСервер.ПриказыВредныеФакторыМедосмотраСВидамиДокументов(Документ);
			
			Для Каждого СтрокаПриказаВредногоФактора Из ПриказыВредныеФакторы Цикл
				ПриказВредныйФактор = СтрокаПриказаВредногоФактора.ПриказВредныйФактор;
				
				ЭтоСтрокаФактора = ДопСерверныеФункции.ИмяСсылочногоТипа(ПриказВредныйФактор) = "Справочник.ПереченьВредныхФакторовИРабот";
				Приказ = ?(ЭтоСтрокаФактора, ПриказВредныйФактор.Приказ, ПриказВредныйФактор);
				
				ШаблонСправки			= Неопределено;
				ВредныйФакторСправки	= Неопределено;
				ПриказВредныйФакторМО	= Неопределено;
				
				Если ЭтоСтрокаФактора
					И МодульМедосмотрыСервер.ЭтоПриказСправки(Приказ)
				Тогда
					ВредныйФакторСправки	= ПриказВредныйФактор;
					ШаблонСправки			= ПриказВредныйФактор.ШаблонОсмотраСправки;
				Иначе
					ПриказВредныйФакторМО	= ПриказВредныйФактор;
				КонецЕсли;
				
				УИДПриказаВредногоФактора = ИнтеграцияЕГИСЗВызовСервера.ПолучитьУИДПоПриказуВредномуФактору(Документ, ПриказВредныйФактор);
				
				ДополнительныеПараметры.УИДШаблона				= УИДПриказаВредногоФактора;
				ДополнительныеПараметры.ШаблонОсмотра			= ШаблонСправки;
				ДополнительныеПараметры.ВредныйФакторСправки	= ВредныйФакторСправки;
				ДополнительныеПараметры.ПриказВредныйФакторМО	= ПриказВредныйФакторМО;
				
				ДолжностьМЗ = ДолжностиМЗ.Получить(УИДПриказаВредногоФактора);
				СформироватьФайлЭМД(Документ, ПутьКАрхивуРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстыОшибок, ФайлыЭМД, ДополнительныеПараметры);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
		ДолжностьМЗ = ДолжностиМЗ.Получить(ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
		СформироватьФайлЭМД(Документ, ПутьКАрхивуРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстыОшибок, ФайлыЭМД, ДополнительныеПараметры);
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		ДолжностьМЗ = ДолжностиМЗ.Получить(ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
		СформироватьФайлЭМД(Документ, ПутьКАрхивуРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстыОшибок, ФайлыЭМД, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат ФайлыЭМД;
	
КонецФункции

Функция ПолучитьДанныеЭлектронныхПодписейИзРезультатаПодписания(ДокументСсылка, ДанныеПодписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сотрудник = ОтраслевыеДополнения.СотрудникПользователяПоФилиалу(ДанныеПодписи.УстановившийПодпись, РаботаСДокументамиСервер.ФилиалДокумента(ДокументСсылка));
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		ВызватьИсключение СтрШаблон("У пользователя ""%1"" нет подходящего сотрудника для ЭМД.", ДанныеПодписи.УстановившийПодпись);
	КонецЕсли;
	
	ЭтоПодписьМО = Ложь;
	Для Каждого Сертификат Из ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьСертификатыМОПользователя() Цикл
		Если Сертификат.Отпечаток = ДанныеПодписи.Отпечаток Тогда
			ЭтоПодписьМО = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ДвоичныеДанныеПодписи, Сотрудник, ЭтоПодписьМО", ДанныеПодписи.Подпись.Получить(), Сотрудник, ЭтоПодписьМО);
	
КонецФункции

Процедура ЗаписатьТекстОшибки(СообщениеРЭМД, Ошибка) Экспорт
	
	Объект = СообщениеРЭМД.ПолучитьОбъект();
	
	Если ТипЗнч(Ошибка) = Тип("Структура") Тогда
		Текст = "";
		
		Если Ошибка.Свойство("ТекстОшибки")
			И ЗначениеЗаполнено(Ошибка.ТекстОшибки)
		Тогда
			Текст = Ошибка.ТекстОшибки;
		Иначе
			Для Каждого Деталь Из Ошибка.Детали Цикл
				Текст = Текст + ?(Текст <> "", Символы.ПС, "") + стрШаблон("%1 %2", Деталь.Код, Деталь.Сообщение);
			КонецЦикла;
		КонецЕсли;
		
		Если Объект.ТекстПоследнейОшибки <> Текст
			Или Объект.Отправить = Истина
			Или Объект.Обновить = Истина
		Тогда
			Объект.ТекстПоследнейОшибки = Текст;
			Если ИнтеграцияЕГИСЗ_РЭМД.ОшибкаВСпискеНаПереотправку(Текст)
				И Объект.КоличествоПереотправок < 20
			Тогда
				Объект.Отправить = Истина;
				Объект.Обновить = Истина;
				Объект.КоличествоПереотправок = Объект.КоличествоПереотправок + 1;
			Иначе
				Объект.Отправить = Ложь;
				Объект.Обновить = Ложь;
			КонецЕсли;
			Объект.Записать();
		КонецЕсли;
	Иначе
		
		Если Объект.ТекстПоследнейОшибки <> Ошибка
			Или Объект.Отправить = Истина
			Или Объект.Обновить = Истина
		Тогда
			Объект.ТекстПоследнейОшибки = Ошибка;
			Если ИнтеграцияЕГИСЗ_РЭМД.ОшибкаВСпискеНаПереотправку(Текст)
				И Объект.КоличествоПереотправок < 20
			Тогда
				Объект.Отправить = Истина;
				Объект.Обновить = Истина;
				Объект.КоличествоПереотправок = Объект.КоличествоПереотправок + 1;
			Иначе
				Объект.Отправить = Ложь;
				Объект.Обновить = Ложь;
			КонецЕсли;
			Объект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДокументаПоEmdrId(emdrId) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	СообщенияРЭМД.ИдентификаторРЭМД = &ИдентификаторРЭМД
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияРЭМД.ПометкаУдаления";
	
	ИдентификаторИНомерВерсии = СтрРазделить(emdrId, "/");
	Если ИдентификаторИНомерВерсии.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИдентификаторРЭМД", СокрЛП(ИдентификаторИНомерВерсии[0]));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СообщениеРЭМД = Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если ИдентификаторИНомерВерсии.Количество() > 1 Тогда
		НомерВерсии = Число(СокрЛП(ИдентификаторИНомерВерсии[1]));
	Иначе
		НомерВерсии = 1;
	КонецЕсли;
	
	ДанныеДокумента = Новый Структура("Ссылка, ИдентификаторДокумента, ОтносительныйПутьКФайлуЭМД", СообщениеРЭМД);
	
	СтрокиВерсии = СообщениеРЭМД.Версии.НайтиСтроки(Новый Структура("НомерВерсии", НомерВерсии));
	Если СтрокиВерсии.Количество() > 0 Тогда
		ДанныеДокумента.ОтносительныйПутьКФайлуЭМД = СтрокиВерсии[0].ПутьКФайлуЭМД;
		ДанныеДокумента.ИдентификаторДокумента = СтрокиВерсии[0].ИдентификаторДокумента;
	Иначе
		// Для совместимости со старыми сообщениями РЭМД, созданными до появления ТЧ "Версии"
		ДанныеДокумента.ОтносительныйПутьКФайлуЭМД = СообщениеРЭМД.ПутьКФайлуЭМД;
		ДанныеДокумента.ИдентификаторДокумента = СообщениеРЭМД.ИдентификаторДокумента;
	КонецЕсли;
	
	Возврат ДанныеДокумента;
	
КонецФункции

Процедура ЗаписатьEmdrId(СообщениеРЭМД, ИдентификаторДокумента, ИдентификаторРЭМД, НомерВерсии, ХранитьДо) Экспорт
	
	Попытка
		НомерВерсииЧисло = Число(НомерВерсии);
	Исключение
		НомерВерсииЧисло = 0;
	КонецПопытки;
	
	ОбъектСообщениеРЭМД = СообщениеРЭМД.ПолучитьОбъект();
	ОбъектИзменен = Ложь;
	
	Если НомерВерсииЧисло >= ОбъектСообщениеРЭМД.НомерВерсии
		Или ОбъектСообщениеРЭМД.ИдентификаторРЭМД <> ИдентификаторРЭМД
	Тогда
		ОбъектСообщениеРЭМД.ИдентификаторРЭМД = ИдентификаторРЭМД;
		ОбъектСообщениеРЭМД.НомерВерсии = НомерВерсииЧисло;
		Если ХранитьДо <> Неопределено Тогда
			ОбъектСообщениеРЭМД.ХранитьДо = ХранитьДо;
		КонецЕсли;
		ОбъектИзменен = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаВерсии Из ОбъектСообщениеРЭМД.Версии.НайтиСтроки(Новый Структура("ИдентификаторДокумента", ИдентификаторДокумента)) Цикл
		СтрокаВерсии.НомерВерсии = ?(НомерВерсииЧисло = 0, 1, НомерВерсииЧисло);
		ОбъектИзменен = Истина;
		Прервать;
	КонецЦикла;
	
	Если ОбъектИзменен Тогда
		ОбъектСообщениеРЭМД.Записать();
	КонецЕсли;
	
	ЗавершитьПроцессРегистрации(СообщениеРЭМД);
	
КонецПроцедуры

Функция ПолучитьДанныеДокументаПоИдентификаторуДокумента(ИдентификаторДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМДВерсии.ПутьКФайлуЭМД КАК ОтносительныйПутьКФайлуЭМД,
		|	СообщенияРЭМДВерсии.ИдентификаторДокумента КАК ИдентификаторДокумента
		|ИЗ
		|	Справочник.СообщенияРЭМД.Версии КАК СообщенияРЭМДВерсии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|		ПО (СообщенияРЭМД.Ссылка = СообщенияРЭМДВерсии.Ссылка)
		|			И (НЕ СообщенияРЭМД.ПометкаУдаления)
		|			И (СообщенияРЭМДВерсии.ИдентификаторДокумента = &ИдентификаторДокумента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка,
		|	СообщенияРЭМД.ПутьКФайлуЭМД,
		|	СообщенияРЭМД.ИдентификаторДокумента
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	НЕ СообщенияРЭМД.ПометкаУдаления
		|	И СообщенияРЭМД.ИдентификаторДокумента = &ИдентификаторДокумента";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеДокумента = Новый Структура("Ссылка, ОтносительныйПутьКФайлуЭМД, ИдентификаторДокумента");
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, Выборка);
		Возврат ДанныеДокумента;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСообщениеРЭМДПоИдентификаторуОтправленногоСообщения(ИдентификаторОтправленногоСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияРЭМДВерсии.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СообщенияРЭМД.Версии КАК СообщенияРЭМДВерсии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|		ПО (СообщенияРЭМД.Ссылка = СообщенияРЭМДВерсии.Ссылка)
		|			И (СообщенияРЭМДВерсии.ИдентификаторСообщения = &ИдентификаторОтправленногоСообщения)
		|			И (НЕ СообщенияРЭМД.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("ИдентификаторОтправленногоСообщения", ИдентификаторОтправленногоСообщения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Попытка
		СообщениеРЭМД = Справочники.СообщенияРЭМД.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторОтправленногоСообщения));
		Если СообщениеРЭМД.ПолучитьОбъект() <> Неопределено Тогда
			Возврат СообщениеРЭМД;
		КонецЕсли;
	Исключение КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияРЭМД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	СообщенияРЭМД.ИдентификаторДокумента В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИнтеграцияЕГИСЗСообщенияРЭМД.ИдентификаторДокумента КАК ИдентификаторДокумента
		|			ИЗ
		|				РегистрСведений.ИнтеграцияЕГИСЗСообщенияРЭМД КАК ИнтеграцияЕГИСЗСообщенияРЭМД
		|			ГДЕ
		|				ИнтеграцияЕГИСЗСообщенияРЭМД.УИДСообщения = &ИдентификаторОтправленногоСообщения)
		|	И СообщенияРЭМД.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ИдентификаторОтправленногоСообщения", ИдентификаторОтправленногоСообщения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДанныеДокументаПоУИД(УИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМД.ПутьКФайлуЭМД КАК ОтносительныйПутьКФайлуЭМД,
		|	СообщенияРЭМД.Документ КАК ДокументИнформационнойБазы,
		|	СообщенияРЭМД.НомерДокумента КАК НомерДокумента,
		|	СообщенияРЭМД.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СообщенияРЭМД.НомерВерсии КАК НомерВерсии
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	СообщенияРЭМД.ПометкаУдаления = ЛОЖЬ
		|	И (СообщенияРЭМД.ИдентификаторШаблонаЭМД = &УИД
		|			ИЛИ СообщенияРЭМД.НомерДокумента = &УИД)";
	Запрос.УстановитьПараметр("УИД", УИД);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеДокументаПоУИДиНомеруДокумента(УИД_Шаблона, УИД_Документа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМД.ПутьКФайлуЭМД КАК ОтносительныйПутьКФайлуЭМД,
		|	СообщенияРЭМД.Документ КАК ДокументИнформационнойБазы,
		|	СообщенияРЭМД.НомерДокумента КАК НомерДокумента,
		|	СообщенияРЭМД.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СообщенияРЭМД.НомерВерсии КАК НомерВерсии
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	СообщенияРЭМД.ПометкаУдаления = ЛОЖЬ
		|	И (СообщенияРЭМД.ИдентификаторШаблонаЭМД = &УИД
		|			ИЛИ СообщенияРЭМД.НомерДокумента = &УИД)
		|	И СообщенияРЭМД.НомерДокумента = &НомерДокумента";
	Запрос.УстановитьПараметр("УИД", УИД_Шаблона);
	Запрос.УстановитьПараметр("НомерДокумента", УИД_Документа);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСообщениеРЭМДПоУИДСообщения(УИДСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК СообщениеРЭМД
		|ИЗ
		|	РегистрСведений.ИнтеграцияЕГИСЗСообщенияРЭМД КАК ИнтеграцияЕГИСЗСообщенияРЭМД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|		ПО (СообщенияРЭМД.ИдентификаторДокумента = ИнтеграцияЕГИСЗСообщенияРЭМД.ИдентификаторДокумента)
		|			И (ИнтеграцияЕГИСЗСообщенияРЭМД.УИДСообщения = &УИДСообщения)";
	
	Запрос.УстановитьПараметр("УИДСообщения", УИДСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СообщениеРЭМД;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьИдентификаторСообщенияВерсии(СообщениеРЭМД, ИдентификаторСообщения) Экспорт
	
	Если СообщениеРЭМД.Версии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СообщениеОбъект = СообщениеРЭМД.ПолучитьОбъект();
	Для Каждого ТекущаяСтрокаВерсии Из СообщениеОбъект.Версии.НайтиСтроки(Новый Структура("ИдентификаторДокумента", СообщениеРЭМД.ИдентификаторДокумента)) Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрокаВерсии.ИдентификаторСообщения) Тогда
			СтрокаВерсии = ТекущаяСтрокаВерсии;
		Иначе
			СтрокаВерсии = СообщениеОбъект.Версии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВерсии, ТекущаяСтрокаВерсии);
		КонецЕсли;
		СтрокаВерсии.ИдентификаторСообщения = ИдентификаторСообщения;
		СтрокаВерсии.ДатаОтправки = ТекущаяДатаСеанса();
	КонецЦикла;
	СообщениеОбъект.ВПроцессеРегистрации = Истина;
	СообщениеОбъект.Записать();
	
КонецПроцедуры

Функция ТребуетсяСозданиеВерсий(Транспорт) Экспорт
	
	Возврат Не ЗначениеЗаполнено(Транспорт);
	
КонецФункции

// Для поддержки старых версий расширений интеграции через альтернативные каналы передачи ЭМД (не прямая интеграция).
// В новых версиях должна быть переопределена
//
Функция ВсегдаСохранятьИсходноеСообщение(СообщениеРЭМД) Экспорт
	
	Возврат ЗначениеЗаполнено(СообщениеРЭМД.Транспорт);
	
КонецФункции

Процедура ПометитьНаУдалениеНеактуальныеСообщения(ДатаСоздания, Документ, ИдентификаторШаблонаЭМД) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМД.ИдентификаторРЭМД КАК ИдентификаторРЭМД
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	НЕ СообщенияРЭМД.ПометкаУдаления
		|	И НЕ СообщенияРЭМД.ВПроцессеРегистрации
		|	И СообщенияРЭМД.Документ = &Документ
		|	И СообщенияРЭМД.ДатаСоздания < &ДатаСоздания
		|	И СообщенияРЭМД.ИдентификаторШаблонаЭМД = &ИдентификаторШаблонаЭМД";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ИдентификаторШаблонаЭМД", ИдентификаторШаблонаЭМД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ИдентификаторРЭМД) Тогда
			Продолжить;
		КонецЕсли;
		ОбъектСообщениеРЭМД = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСообщениеРЭМД.Отправить = Ложь;
		ОбъектСообщениеРЭМД.Обновить = Ложь;
		ОбъектСообщениеРЭМД.ПометкаУдаления = Истина;
		ОбъектСообщениеРЭМД.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ИмеютсяБолееАктуальныеСообщения(ДатаСоздания, Документ, ИдентификаторШаблонаЭМД) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМД.ИдентификаторРЭМД КАК ИдентификаторРЭМД
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	НЕ СообщенияРЭМД.ПометкаУдаления
		|	И НЕ СообщенияРЭМД.ВПроцессеРегистрации
		|	И СообщенияРЭМД.Документ = &Документ
		|	И СообщенияРЭМД.ДатаСоздания > &ДатаСоздания
		|	И СообщенияРЭМД.ИдентификаторШаблонаЭМД = &ИдентификаторШаблонаЭМД";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ИдентификаторШаблонаЭМД", ИдентификаторШаблонаЭМД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗавершитьПроцессРегистрации(СообщениеРЭМД) Экспорт
	
	Если ЗначениеЗаполнено(СообщениеРЭМД)
		И СообщениеРЭМД.ВПроцессеРегистрации
	Тогда
		ОбъектСообщениеРЭМД = СообщениеРЭМД.ПолучитьОбъект();
		ОбъектСообщениеРЭМД.ВПроцессеРегистрации = Ложь;
		ОбъектСообщениеРЭМД.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ОбновитьТЧСообщенияРЭМД(ПараметрыОбновления) Экспорт
	
	мСообщенияСУстановленнымиПодписями = Новый Массив;
	Для Каждого СтрокаЭЦП Из ПараметрыОбновления.УИДыЭЦП Цикл
		
		СообщениеРЭМД = СтрокаЭЦП.СообщениеРЭМД;
		
		Если ЗначениеЗаполнено(СообщениеРЭМД) Тогда
			ИдентификаторРЭМД = ИнтеграцияЕГИСЗ_РЭМД.ПолучитьИдентификаторИНомерДокументаДляРЭМД(СообщениеРЭМД.Документ, , СообщениеРЭМД.ИдентификаторШаблонаЭМД);
			
			ДвоичныеДанныеПодписи = СтрокаЭЦП.СвойстваПодписи.Подпись;
			СРЭМД = СообщениеРЭМД.ПолучитьОбъект();
			
			УдалитьСтрокиПодписейМО(СРЭМД);
			
			НомерПодписи	= СРЭМД.ЭлектронныеПодписиЭМД.Количество() + 1;
			ИмяФайлаПодписи	= ИдентификаторРЭМД.ИдентификаторДокумента + "_sign" + НомерПодписи;
			ПутиДляПодписи	= ИнтеграцияЕГИСЗСервер.ПолучитьНовыйПутьКФайлуВХранилище(ИмяФайлаПодписи, СообщениеРЭМД.Документ.Филиал);
			ДвоичныеДанныеПодписи.Записать(ПутиДляПодписи.ПолныйПуть);
			
			СРЭМД.Отправить = Истина;
			
			Подпись = СРЭМД.ЭлектронныеПодписиЭМД.Добавить();
			Подпись.ПутьКФайлуПодписиЭМД = ПутиДляПодписи.ОтносительныйПуть;
			Подпись.Сотрудник			 = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
			Подпись.РольРЭМД			 = СтрокаЭЦП.РольПодписи;
			Подпись.ЭтоПодписьМО		 = Истина;
			Подпись.УИД_ЭЦП				 = СтрокаЭЦП.ПолученныйУИДЭЦП;
			Попытка
				СРЭМД.Записать();
				мСообщенияСУстановленнымиПодписями.Добавить(СообщениеРЭМД);
			Исключение
				СообщениеДляЖР = СтрШаблон("Ошибка при сохранении данных подписи МО в сообщении  ""%1"" :", СообщениеРЭМД);
				ЗаписьЖурналаРегистрации("ИнтеграцияЕГИСЗ.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, СообщениеДляЖР);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка при сохранении данных подписи МО в сообщении  ""%1"" :", СообщениеРЭМД));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат мСообщенияСУстановленнымиПодписями;
	
КонецФункции

#Область АктОтзываЭМД

Функция СформироватьНаименованиеМИС(СообщениеРЭМД, НаименованиеМИС) Экспорт
	
	Если Не ЗначениеЗаполнено(СообщениеРЭМД.Транспорт) Тогда
		Возврат СтрШаблон("МИС ""%1""", НаименованиеМИС);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ДанныеМетаданныхДляАкта(СообщениеРЭМД) Экспорт
	
	МетаданныеДокумента = ИнтеграцияЕГИСЗ_РЭМД.ПолучитьМетаданныеДокументаИзРЭМД(СообщениеРЭМД.ИдентификаторРЭМД, Неопределено);
	
	Если ТипЗнч(МетаданныеДокумента) = Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураМетаданных = МетаданныеДокумента.Структура;
	
	ДанныеМетаданныхДляАкта = Новый Структура;
	ДанныеМетаданныхДляАкта.Вставить("OIDМедицинскойОрганизации",	СтруктураМетаданных.organization);
	ДанныеМетаданныхДляАкта.Вставить("OIDДокумента",				СтруктураМетаданных.kind);
	ДанныеМетаданныхДляАкта.Вставить("ДатаСоздания",				ПолучитьДатуБезУчетаЧасовогоПояса(СтруктураМетаданных.creationDate));
	ДанныеМетаданныхДляАкта.Вставить("ДатаРегистрации",				ПолучитьДатуБезУчетаЧасовогоПояса(СтруктураМетаданных.registrationDate));
	
	Возврат ДанныеМетаданныхДляАкта;
	
КонецФункции

Функция ПолучитьДатуБезУчетаЧасовогоПояса(ДатаСтрокой)
	
	РазделительСмещение = Неопределено;
	Если СтрНайти(ДатаСтрокой, "+") > 0 Тогда
		РазделительСмещение = "+";
	ИначеЕсли СтрНайти(ДатаСтрокой, "-") > 0 Тогда
		РазделительСмещение = "-";
	Иначе
		Возврат XMLЗначение(Тип("Дата"), ДатаСтрокой);
	КонецЕсли;
	
	ДатаИСмещение = СтрРазделить(ДатаСтрокой, РазделительСмещение, Ложь);
	Смещение = ДатаИСмещение[1];
	Возврат МестноеВремя(УниверсальноеВремя(XMLЗначение(Тип("Дата"), ДатаСтрокой)), "GMT" + РазделительСмещение + Смещение);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьФайлЭМД(Документ, ПутьКАрхивуРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстыОшибок, ФайлыЭМД, ДополнительныеПараметры)
	
	ИдентификаторРЭМД = ИнтеграцияЕГИСЗ_РЭМД.ПолучитьИдентификаторИНомерДокументаДляРЭМД(Документ, Истина, ДополнительныеПараметры.УИДШаблона);
	
	ТекстОшибки = "";
	ФайлЭМД = СформироватьФайлЭМДПоШаблону(Документ, ИдентификаторРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстОшибки, ПутьКАрхивуРЭМД, ДополнительныеПараметры);
	Если ФайлЭМД <> Неопределено Тогда
		ФайлыЭМД.Добавить(ФайлЭМД);
	ИначеЕсли Не ПустаяСтрока(ТекстОшибки) Тогда
		ТекстыОшибок.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлЭМДПоШаблону(Документ, ИдентификаторРЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, ТекстОшибки, ПутьКАрхивуРЭМД, ДополнительныеПараметры)
	
	СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Документ, ДополнительныеПараметры);
	
	ФайлСформирован = Ложь;
	ВидДокумента = СвойстваЭМД.ВидРЭМД;
	
	ШаблонОсмотра = ДополнительныеПараметры.ШаблонОсмотра;
	СтрокаШаблона = ДополнительныеПараметры.СтрокаШаблона;
	
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКАрхивуРЭМД) + ИдентификаторРЭМД.ИдентификаторДокумента;
	
	// ЭМД формируются только по тем шаблонам, у которых указан вид ЭМД из специального классификатора.
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		
		НаименованиеШаблона = "";
		Если ЗначениеЗаполнено(ШаблонОсмотра) Тогда
			НаименованиеШаблона = ?(ТипЗнч(ШаблонОсмотра) = Тип("СправочникСсылка.ШаблоныHTML"), ШаблонОсмотра.Наименование, ШаблонОсмотра.Владелец.Наименование);
		КонецЕсли;
		
		МассивСтрок = ВидДокумента.Атрибуты.НайтиСтроки(Новый Структура("Ключ", "FORMAT"));
		// Конечный формат файла либо *.xml, либо *.PDF/A - в зависимости от описания выбранного вида ЭМД.
		Если МассивСтрок.Количество() > 0 И МассивСтрок[0].Значение = "2" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".xml";
			
			Попытка
				ТекстXML = ИнтеграцияЕГИСЗВызовСервера.ПолучитьXMLПоСсылкеМД(Документ, СвойстваЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, НаименованиеШаблона, ТекстОшибки, ДополнительныеПараметры);
				Если ТекстXML <> Неопределено Тогда
					XML = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
					XML.ЗаписатьСтроку(ТекстXML);
					XML.Закрыть();
					ФайлСформирован = Истина;
				//Иначе
				//	ТекстОшибки = СтрШаблон(НСтр("ru='Для шаблона ""%1"" выбран вид регистрируемого электронного документа ""%2"", не поддерживаемый программой!'"), НаименованиеШаблона, ШаблонОсмотра.ВидДокумента.Наименование);
				КонецЕсли;
			Исключение
				ТекстОшибки = СформироватьОшибкуФормированияXML(Документ, НаименованиеШаблона, ОписаниеОшибки());
			КонецПопытки;
		Иначе
			ИмяФайла = ИмяФайлаБезРасширения + ".pdf";
			
			ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Документ);
			Если ИмяТипаДокумента = "Документ.Прием" Тогда
				
				ТекстДляПечати = РаботаСШаблонамиHTMLКлиентСервер.УдалитьТекстHTMLЭЦП(СтрокаШаблона.ТекстДляПечати, Истина);
				ДанныеРисунков = РаботаСШаблонамиHTML.ДобавитьРисункиКартинок(ТекстДляПечати, Документ, ДополнительныеПараметры.ИндексШаблона);
				ТекстДляПечати = РаботаСШаблонамиHTML.ДекодироватьИзображенияHTMLТекста(ТекстДляПечати, ШаблонОсмотра.СписокИзображений, ДанныеРисунков);
				
				Если ТекстДляПечати <> Неопределено Тогда
					ДДФайлаPDF = РаботаСШаблонамиHTMLКлиентСервер.ПреобразоватьHTMLвPDF(ТекстДляПечати, ОбщегоНазначения.ЭтоLinuxСервер(), Ложь, , Истина, Истина);
					Если ДДФайлаPDF <> Неопределено Тогда
						Попытка
							ДДФайлаPDF.Записать(ИмяФайла);
							ФайлСформирован = Истина;
						Исключение КонецПопытки;
					КонецЕсли;
				КонецЕсли;
				
				Если Не ФайлСформирован Тогда
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Форматирование шаблона: %1 в pdf не удалась!'"), НаименованиеШаблона);
				КонецЕсли;
				
			ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
				
				Если СформироватьPDFСправки(Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки, Документ.ПараметрыПриема, ИмяФайла) Тогда
					ФайлСформирован = Истина;
				Иначе
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Форматирование шаблона: %1 в pdf не удалась!'"), НаименованиеШаблона);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ФайлСформирован Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Подготовим все необходимые данные, чтобы можно было сопоставить полученный файл ЭМД с шаблоном HTML, по которому он сформирован.
	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("ДД",						Новый ДвоичныеДанные(ИмяФайла));
	ДанныеФайла.Вставить("ИмяФайла",				ИмяФайла);
	ДанныеФайла.Вставить("ШаблонПриема",			ШаблонОсмотра);
	ДанныеФайла.Вставить("ВидДокументаШаблона",		ВидДокумента);
	ДанныеФайла.Вставить("ОтносительныйПуть",		ПолучитьОтносительныйПутьФайлаВАрхиве(ИмяФайла));
	ДанныеФайла.Вставить("ИдентификаторДокумента",	ИдентификаторРЭМД.ИдентификаторДокумента);
	
	Если СтрокаШаблона <> Неопределено Тогда
		ДанныеФайла.Вставить("УИД_Шаблона", СтрокаШаблона.УИД);
	ИначеЕсли ЗначениеЗаполнено(ДополнительныеПараметры.ПриказВредныйФакторМО) Тогда
		ДанныеФайла.Вставить("УИД_Шаблона", ИнтеграцияЕГИСЗВызовСервера.ПолучитьУИДПоПриказуВредномуФактору(Документ, ДополнительныеПараметры.ПриказВредныйФакторМО));
	ИначеЕсли ЗначениеЗаполнено(ДополнительныеПараметры.ВредныйФакторСправки) Тогда
		ДанныеФайла.Вставить("УИД_Шаблона", ИнтеграцияЕГИСЗВызовСервера.ПолучитьУИДПоПриказуВредномуФактору(Документ, ДополнительныеПараметры.ВредныйФакторСправки));
	КонецЕсли;
	
	Возврат ДанныеФайла;
	
КонецФункции

Функция ПолучитьОтносительныйПутьФайлаВАрхиве(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Имя;
	
КонецФункции

Функция СформироватьОшибкуФормированияXML(Документ, НаименованиеШаблона, ОписаниеОшибки)
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Документ);
	
	СтрокиТекстаОшибки = Новый Массив;
	Если ИнтеграцияЕГИСЗВызовСервера.ДокументЯвляетсяЗаключениемМедосмотра(Документ) Тогда
		СтрокиТекстаОшибки.Добавить(СтрШаблон(НСтр("ru='Формирование файла xml по документу медосмотра не удалось!'")));
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		СтрокиТекстаОшибки.Добавить(СтрШаблон(НСтр("ru='Формирование файла xml по рецепту не удалось!'")));
	Иначе
		СтрокиТекстаОшибки.Добавить(СтрШаблон(НСтр("ru='Формирование файла xml по шаблону: %1 не удалось!'"), НаименованиеШаблона));
	КонецЕсли;
	
	СтрокиТекстаОшибки.Добавить(ОписаниеОшибки);
	
	Возврат СтрСоединить(СтрокиТекстаОшибки, Символы.ПС);
	
КонецФункции

Функция СформироватьPDFСправки(Шаблон, ПараметрыПриема, ИмяФайла)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Область(1,1).Текст = НСтр("ru='Не удалось сформировать форму для печати'");
	
	Если ЗначениеЗаполнено(Шаблон)
		И Шаблон.ВидШаблона = Перечисления.ВидыШаблонов.ТабличныйДокумент
	Тогда
		ТабДок = Шаблон.ТабличныйДокумент.Получить();
		Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
			
			ЗначенияПараметров = Новый Структура;
			Для Каждого СтрокаПараметра Из Шаблон.СоответствияПараметрам Цикл
				Если ЗначениеЗаполнено(СтрокаПараметра.Параметр) Тогда
					мсСтрокаПриема = ПараметрыПриема.НайтиСтроки(Новый Структура("Параметр", СтрокаПараметра.Параметр));
					Если мсСтрокаПриема.Количество() <> 0 Тогда
						Попытка
							Значение = мсСтрокаПриема[0].Значение;
							Значение = Формат(Значение, СтрокаПараметра.Параметр.ФорматнаяСтрока);
							
							ЗначенияПараметров.Вставить(СтрокаПараметра.Наименование, Значение);
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ТабДок.Параметры.Заполнить(ЗначенияПараметров);
			
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ТабДок);
			
			// Настройки печати
			ТабличныйДокумент.ИмяПараметровПечати = Строка(Шаблон.УникальныйИдентификатор());
			
			ТабличныйДокумент.АвтоМасштаб = Шаблон.ПечатьАвтомасштабирование;
			ТабличныйДокумент.ОриентацияСтраницы = ?(Шаблон.ПечатьОриентацияСтраницы, ОриентацияСтраницы.Ландшафт, ОриентацияСтраницы.Портрет);
			
			Если ЗначениеЗаполнено(Шаблон.ПечатьРазмерБумаги) Тогда
				ТабличныйДокумент.РазмерСтраницы = Шаблон.ПечатьРазмерБумаги;
			КонецЕсли;
			
			Если Шаблон.ПечатьДвусторонняяПечать = 0 Тогда
				ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ИспользоватьНастройкиПринтера;
			ИначеЕсли Шаблон.ПечатьДвусторонняяПечать = 1 Тогда
				ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.Нет;
			ИначеЕсли Шаблон.ПечатьДвусторонняяПечать = 2 Тогда
				ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВверх;
			ИначеЕсли Шаблон.ПечатьДвусторонняяПечать = 3 Тогда
				ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
			КонецЕсли;
			
			СистемнаяИнформация = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.15.0") > 0 Тогда
				ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF_A_1);
			Иначе
				ВызватьИсключение(НСтр("ru='Отправка в РЭМД медицинских документов в формате pdf возможна при использовании платформы не ниже 8.3.15 версии'"));
			КонецЕсли;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьНовыйПутьКФайлуВХранилище(ИмяФайла, Филиал)
	
	ПутьКХранилищу = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПутьКАрхивуРЭМД(Филиал);
	
	Если Не ЗначениеЗаполнено(ПутьКХранилищу) Тогда
		
		ВызватьИсключение "Не заполнен путь к хранилищу файлов ЭМД.";
	КонецЕсли;
	
	РеквизитыОрганизации = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьOIDИНаменованиеМедицинскойОрганизации(Филиал);
	
	Если Не ЗначениеЗаполнено(РеквизитыОрганизации.КодOIDМедицинскойОрганизации) Тогда
		
		ВызватьИсключение "Не заполнен ""Код OID Медицинской организации"" у организации: " + РеквизитыОрганизации.Наименование;
	КонецЕсли;
	
	// путь исключая путь к хранилищу.
	ОтносительныйПуть = РеквизитыОрганизации.КодOIDМедицинскойОрганизации + ПолучитьРазделительПути()
				+ Формат(ТекущаяДатаСеанса(), "ДФ=ггггММдд") + ПолучитьРазделительПути();
				
	ПолныйПуть = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКХранилищу)
					+ ОтносительныйПуть;
	
	ИмяФайлаСПутем = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьУникальноеИмяСПутем(ПолныйПуть, ИмяФайла);
	ПолноеИмяФайлаСПутем = ПолныйПуть + ИмяФайлаСПутем;
	
	ИмяФайлаСОтносительнымПутем = ОтносительныйПуть + ИмяФайлаСПутем; // путь исключая путь к хранилищу.
	
	Возврат Новый Структура("ПолныйПуть, ОтносительныйПуть", ПолноеИмяФайлаСПутем, ИмяФайлаСОтносительнымПутем);
	
КонецФункции

Функция ДобавитьСообщениеВСправочник(ДанныеСообщения, ЭлектронныеПодписи)
	
	СтрокаВерсии = Неопределено;
	
	Если ДанныеСообщения.Свойство("СообщениеРЭМД")
		И ЗначениеЗаполнено(ДанныеСообщения.СообщениеРЭМД)
	Тогда
		ОбъектСообщения = ДанныеСообщения.СообщениеРЭМД.ПолучитьОбъект();
		Если ОбъектСообщения.Версии.Количество() > 0 Тогда
			СтрокаПоТекущемуИдентификатору = ОбъектСообщения.Версии.Найти(ОбъектСообщения.ИдентификаторДокумента, "ИдентификаторДокумента");
			Если СтрокаПоТекущемуИдентификатору <> Неопределено
				И Не ЗначениеЗаполнено(СтрокаПоТекущемуИдентификатору.НомерВерсии)
				И Не ЗначениеЗаполнено(СтрокаПоТекущемуИдентификатору.ИдентификаторСообщения)
			Тогда
				СтрокаВерсии = СтрокаПоТекущемуИдентификатору;
			Иначе
				СтрокаВерсии = ОбъектСообщения.Версии.Добавить();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОбъектСообщения = Справочники.СообщенияРЭМД.СоздатьЭлемент();
		ОбъектСообщения.ДатаСоздания	= ТекущаяДатаСеанса();
		ОбъектСообщения.Наименование	= ДанныеСообщения.ИдентификаторДокумента;
		ОбъектСообщения.Документ		= ДанныеСообщения.Документ;
		ОбъектСообщения.Клиент			= ДанныеСообщения.Клиент;
		ОбъектСообщения.ВидДокумента	= ДанныеСообщения.ВидДокумента;
		ОбъектСообщения.НомерДокумента	= ДанныеСообщения.НомерДокумента;
		СтрокаВерсии = ОбъектСообщения.Версии.Добавить();
	КонецЕсли;
	
	ОбъектСообщения.ИдентификаторДокумента	= ДанныеСообщения.ИдентификаторДокумента;
	ОбъектСообщения.ПутьКФайлуЭМД			= ДанныеСообщения.ПутьКФайлуЭМД;
	ОбъектСообщения.ТекстПоследнейОшибки	= "";
	ОбъектСообщения.КоличествоПереотправок = 0;
	
	Если СтрокаВерсии <> Неопределено Тогда
		СтрокаВерсии.ИдентификаторДокумента	= ДанныеСообщения.ИдентификаторДокумента;
		СтрокаВерсии.ПутьКФайлуЭМД			= ДанныеСообщения.ПутьКФайлуЭМД;
	КонецЕсли;
	
	Если ВыполненоТребованиеУстановкиПодписиМО(ДанныеСообщения.ВидДокумента, ЭлектронныеПодписи) Тогда
		ОбъектСообщения.Обновить	= ЗначениеЗаполнено(ОбъектСообщения.Ссылка);
		ОбъектСообщения.Отправить	= Истина;
	КонецЕсли;
	
	Если ДанныеСообщения.Свойство("УИД_Шаблона") Тогда
		ОбъектСообщения.ИдентификаторШаблонаЭМД = ДанныеСообщения.УИД_Шаблона;
	КонецЕсли;
	
	УдаляемыеФайлы = Новый Массив;
	Для Каждого СтрокаПодписи Из ОбъектСообщения.ЭлектронныеПодписиЭМД Цикл
		УдаляемыеФайлы.Добавить(СтрокаПодписи.ПутьКФайлуПодписиЭМД);
	КонецЦикла;
	
	ОбъектСообщения.ЭлектронныеПодписиЭМД.Очистить();
	
	Для Каждого Подпись Из ЭлектронныеПодписи Цикл
		НоваяСтрока = ОбъектСообщения.ЭлектронныеПодписиЭМД.Добавить();
		НоваяСтрока.ПутьКФайлуПодписиЭМД	= Подпись.ОтносительныйПутьКФайлуПодписиЭМД;
		НоваяСтрока.Сотрудник				= Подпись.Сотрудник;
		НоваяСтрока.РольРЭМД				= Подпись.РольРЭМД;
		НоваяСтрока.УИД_ЭЦП					= Подпись.УИД_ЭЦП;
		НоваяСтрока.ДолжностьМинздрава		= Подпись.ДолжностьМинздрава;
		НоваяСтрока.СпециальностьМинздрава	= Подпись.СпециальностьМинздрава;
		
		//TODO: Проверка на подпись МО
		Если ИнтеграцияЕГИСЗ_РЭМД.ВидДокументаТребуетПодписьМО(ДанныеСообщения.ВидДокумента) Тогда
			Если ЗначениеЗаполнено(НоваяСтрока.РольРЭМД)
				И Подпись.ЭтоПодписьМО
			Тогда
				Если ОбъектСообщения.ЭлектронныеПодписиЭМД.Найти(Истина, "ЭтоПодписьМО") = Неопределено Тогда
					СтрокаПодписиМО = ОбъектСообщения.ЭлектронныеПодписиЭМД.Добавить();
					СтрокаПодписиМО.ПутьКФайлуПодписиЭМД = Подпись.ОтносительныйПутьКФайлуПодписиЭМД;
					СтрокаПодписиМО.Сотрудник			 = Подпись.Сотрудник;
					СтрокаПодписиМО.ЭтоПодписьМО		 = Истина;
					СтрокаПодписиМО.УИД_ЭЦП				 = Подпись.УИД_ЭЦП;
				КонецЕсли;
			Иначе
				НоваяСтрока.ЭтоПодписьМО = Подпись.ЭтоПодписьМО;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбъектСообщения.Транспорт = Неопределено;
	ОбъектСообщения.Записать();
	ИнтеграцияЕГИСЗ_РЭМД.УдалитьФайлыИзАрхиваЭМД(УдаляемыеФайлы, ДанныеСообщения.Документ.Филиал);
	
	Если ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьРежимОтправкиСообщения() = Перечисления.РежимыОтправкиСообщенийРЭМД.ПриПодписанииДокумента
		И УстановленыПодписиПоВсемПравилам(ОбъектСообщения.Ссылка)
		И Не ДанныеСообщения.Документ.Тестовый
		И ВыполненоТребованиеУстановкиПодписиМО(ДанныеСообщения.ВидДокумента, ЭлектронныеПодписи)
	Тогда
		Попытка
			РезультатОтРЭМД = ИнтеграцияЕГИСЗ_РЭМД.ЗарегистрироватьДокументВРЭМД(ОбъектСообщения.Ссылка);
			
			Если РезультатОтРЭМД <> Истина Тогда
				Если Не (ТипЗнч(РезультатОтРЭМД) = Тип("Структура")
						И РезультатОтРЭМД.Свойство("ДостигнутЛимит")
						И РезультатОтРЭМД.ДостигнутЛимит = Истина)
				Тогда
					ЗаписатьТекстОшибки(ОбъектСообщения.Ссылка, РезультатОтРЭМД);
				КонецЕсли;
			Иначе
				ЗаписатьТекстОшибки(ОбъектСообщения.Ссылка, "");
			КонецЕсли;
		Исключение
			Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписатьТекстОшибки(ОбъектСообщения.Ссылка, Текст);
			ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка,,,ОбъектСообщения.Ссылка);
		КонецПопытки;
	КонецЕсли;
	
	Возврат ОбъектСообщения.Ссылка;
	
КонецФункции

Функция УстановленыПодписиПоВсемПравилам(СообщениеРЭМД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭМД.СообщениеРЭМД КАК СообщениеРЭМД,
		|	ЭМД.УИД КАК УИД,
		|	ЭМД.УИД_Шаблона КАК УИД_Шаблона
		|ПОМЕСТИТЬ ЭМД
		|ИЗ
		|	&ЭМД КАК ЭМД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РолиИПодписиЭМД.РольСотрудника КАК РольСотрудника,
		|	РолиИПодписиЭМД.УИД_ЭЦП КАК УИД_ЭЦП,
		|	РолиИПодписиЭМД.УИД_ЭМД КАК УИД_ЭМД
		|ПОМЕСТИТЬ РолиИПодписиЭМД
		|ИЗ
		|	&РолиИПодписиЭМД КАК РолиИПодписиЭМД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РЭМДПравилаПодписи.Ссылка КАК Правило,
		|	РЭМДПравилаПодписи.МинКолПодписей КАК МинКолПодписей,
		|	ЭлектронныеПодписи.УникальныйИдентификатор КАК УникальныйИдентификатор
		|ПОМЕСТИТЬ ПодписиПоРолям
		|ИЗ
		|	Справочник.РЭМДПравилаПодписи КАК РЭМДПравилаПодписи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|		ПО (СообщенияРЭМД.Ссылка = &СообщениеРЭМД)
		|			И (СообщенияРЭМД.ВидДокумента = РЭМДПравилаПодписи.ВидДокумента)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЭМД КАК ЭМД
		|		ПО (ЭМД.УИД_Шаблона = &ИдентификаторШаблонаЭМД)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РолиИПодписиЭМД КАК РолиИПодписиЭМД
		|		ПО (ЭМД.УИД = РолиИПодписиЭМД.УИД_ЭМД)
		|			И (РолиИПодписиЭМД.РольСотрудника = РЭМДПравилаПодписи.Роль)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|		ПО (ЭлектронныеПодписи.Объект = СообщенияРЭМД.Документ)
		|			И (ЭлектронныеПодписи.УникальныйИдентификатор = РолиИПодписиЭМД.УИД_ЭЦП)
		|			И (ЭлектронныеПодписи.ПодписанФайлЭМД)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ПодписиПоРолям.Правило) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ПодписиПоРолям.Правило КАК Правило,
		|		ПодписиПоРолям.МинКолПодписей КАК МинКолПодписей
		|	ИЗ
		|		ПодписиПоРолям КАК ПодписиПоРолям) КАК ПодписиПоРолям
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПодписиПоРолям.Правило КАК Правило,
		|			КОЛИЧЕСТВО(ПодписиПоРолям.УникальныйИдентификатор) КАК КоличествоЭП
		|		ИЗ
		|			ПодписиПоРолям КАК ПодписиПоРолям
		|		ГДЕ
		|			НЕ ПодписиПоРолям.УникальныйИдентификатор ЕСТЬ NULL
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПодписиПоРолям.Правило) КАК КоличествоЭППоПравилам
		|		ПО (КоличествоЭППоПравилам.Правило = ПодписиПоРолям.Правило)
		|ГДЕ
		|	ПодписиПоРолям.МинКолПодписей > ЕСТЬNULL(КоличествоЭППоПравилам.КоличествоЭП, 0)";
	
	Запрос.УстановитьПараметр("СообщениеРЭМД",				СообщениеРЭМД);
	Запрос.УстановитьПараметр("ЭМД",						СообщениеРЭМД.Документ.ЭМД.Выгрузить());
	Запрос.УстановитьПараметр("РолиИПодписиЭМД",			СообщениеРЭМД.Документ.РолиИПодписиЭМД.Выгрузить());
	Запрос.УстановитьПараметр("ИдентификаторШаблонаЭМД",	Новый УникальныйИдентификатор(СообщениеРЭМД.ИдентификаторШаблонаЭМД));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество = 0;
	
КонецФункции

Функция ВыполненоТребованиеУстановкиПодписиМО(ВидДокумента, МассивПодписей)
	
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуетсяПодписьМО = Истина;
	Попытка
		ТребуетсяПодписьМО = Булево(ВидДокумента.Атрибуты.Найти("MO_SIGN").Значение) = Истина;
	Исключение КонецПопытки;
	
	Если Не ТребуетсяПодписьМО Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрокаПодписи Из МассивПодписей Цикл
		Если СтрокаПодписи.ЭтоПодписьМО Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура УдалитьСтрокиПодписейМО(СообщениеРЭМД)
	
	СтрокиМО = СообщениеРЭМД.ЭлектронныеПодписиЭМД.НайтиСтроки(Новый Структура("ЭтоПодписьМО", Истина));
	Для Каждого СтрокаМО Из СтрокиМО Цикл
		СообщениеРЭМД.ЭлектронныеПодписиЭМД.Удалить(СтрокаМО);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
